In [1]:
import pandas as pd
print(pd.__version__)

2.3.3

In [2]:
# создание объекта Series из списка

countries = pd.Series(
    data = ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    index = ['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ'],
    name = 'countries'
)
display(countries)

UK       Англия
CA       Канада
US          США
RU       Россия
UA      Украина
BY     Беларусь
KZ    Казахстан
Name: countries, dtype: object

In [3]:
# создание Series из словаря

countries = pd.Series({
    'UK': 'Англия',
    'CA': 'Канада',
    'US' : 'США',
    'RU': 'Россия',
    'UA': 'Украина',
    'BY': 'Беларусь',
    'KZ': 'Казахстан'},
    name = 'countries'
    
)
display(countries)

UK       Англия
CA       Канада
US          США
RU       Россия
UA      Украина
BY     Беларусь
KZ    Казахстан
Name: countries, dtype: object

In [4]:
print(countries.loc['US'])
print(countries.loc[['US', 'RU', 'UK']])

США
US       США
RU    Россия
UK    Англия
Name: countries, dtype: object

In [5]:
print(countries.iloc[6])
print(countries.iloc[1:4])

Казахстан
CA    Канада
US       США
RU    Россия
Name: countries, dtype: object

In [6]:
import pandas as pd
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'area': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})

In [7]:
# Запись в файл датафрейма
countries_df.to_csv('data/countries.csv', index=False, sep=';')

In [8]:
# чтение csv
countries_data = pd.read_csv('data/countries.csv', sep=';')
display(countries_data)

     country  population      area
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

In [9]:
data = pd.read_csv('https://raw.githubusercontent.com/esabunor/MLWorkspace/master/melb_data.csv')
display(data)

,Unnamed: 0,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,1,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.79960,144.99840,Northern Metropolitan,4019.0
1,2,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.80790,144.99340,Northern Metropolitan,4019.0
2,4,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.80930,144.99440,Northern Metropolitan,4019.0
3,5,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.79690,144.99690,Northern Metropolitan,4019.0
4,6,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.80720,144.99410,Northern Metropolitan,4019.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18391,23540,Williamstown,8/2 Thompson St,2,t,622500.0,SP,Greg,26/08/2017,6.8,...,2.0,1.0,NaN,89.0,2010.0,NaN,-37.86393,144.90484,Western Metropolitan,6380.0
18392,23541,Williamstown,96 Verdon St,4,h,2500000.0,PI,Sweeney,26/08/2017,6.8,...,1.0,5.0,866.0,157.0,1920.0,NaN,-37.85908,144.89299,Western Metropolitan,6380.0
18393,23544,Yallambie,17 Amaroo Wy,4,h,1100000.0,S,Buckingham,26/08/2017,12.7,...,3.0,2.0,NaN,NaN,NaN,NaN,-37.72006,145.10547,Northern Metropolitan,1369.0
18394,23545,Yarraville,6 Agnes St,4,h,1285000.0,SP,Village,26/08/2017,6.3,...,1.0,1.0,362.0,112.0,1920.0,NaN,-37.81188,144.88449,Western Metropolitan,6543.0
18395,23546,Yarraville,33 Freeman St,4,h,1050000.0,VB,Village,26/08/2017,6.3,...,2.0,2.0,NaN,139.0,1950.0,NaN,-37.81829,144.87404,Western Metropolitan,6543.0

In [10]:
melb_data = pd.read_csv('data/melb_data.csv', sep=',')

In [11]:
melb_data.head()

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
0,0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,...,1.0,202.0,126.0,1970.0,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0,"-37.7996, 144.9984"
1,1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,...,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0,"-37.8079, 144.9934"
2,2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,...,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0,"-37.8093, 144.9944"
3,3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,...,1.0,94.0,126.0,1970.0,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0,"-37.7969, 144.9969"
4,4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,...,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0,"-37.8072, 144.9941"

In [12]:
melb_data.tail(7)

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
13573,13573,Werribee,5 Nuragi Ct,4,h,635000.0,S,hockingstuart,26/08/2017,14.7,...,1.0,662.0,172.0,1980.0,NaN,-37.89327,144.64789,Western Metropolitan,16166.0,"-37.89327, 144.64789"
13574,13574,Westmeadows,9 Black St,3,h,582000.0,S,Red,26/08/2017,16.5,...,2.0,256.0,126.0,1970.0,NaN,-37.67917,144.89390,Northern Metropolitan,2474.0,"-37.67917, 144.8939"
13575,13575,Wheelers Hill,12 Strada Cr,4,h,1245000.0,S,Barry,26/08/2017,16.7,...,2.0,652.0,126.0,1981.0,NaN,-37.90562,145.16761,South-Eastern Metropolitan,7392.0,"-37.90562, 145.16761"
13576,13576,Williamstown,77 Merrett Dr,3,h,1031000.0,SP,Williams,26/08/2017,6.8,...,2.0,333.0,133.0,1995.0,NaN,-37.85927,144.87904,Western Metropolitan,6380.0,"-37.85927, 144.87904"
13577,13577,Williamstown,83 Power St,3,h,1170000.0,S,Raine,26/08/2017,6.8,...,4.0,436.0,126.0,1997.0,NaN,-37.85274,144.88738,Western Metropolitan,6380.0,"-37.85274, 144.88738"
13578,13578,Williamstown,96 Verdon St,4,h,2500000.0,PI,Sweeney,26/08/2017,6.8,...,5.0,866.0,157.0,1920.0,NaN,-37.85908,144.89299,Western Metropolitan,6380.0,"-37.85908, 144.89299"
13579,13579,Yarraville,6 Agnes St,4,h,1285000.0,SP,Village,26/08/2017,6.3,...,1.0,362.0,112.0,1920.0,NaN,-37.81188,144.88449,Western Metropolitan,6543.0,"-37.81188, 144.88449"

In [13]:
melb_data.shape

(13580, 23)

In [14]:
melb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          13580 non-null  int64
 1   Suburb         13580 non-null  object
 2   Address        13580 non-null  object
 3   Rooms          13580 non-null  int64
 4   Type           13580 non-null  object
 5   Price          13580 non-null  float64
 6   Method         13580 non-null  object
 7   SellerG        13580 non-null  object
 8   Date           13580 non-null  object
 9   Distance       13580 non-null  float64
 10  Postcode       13580 non-null  int64
 11  Bedroom        13580 non-null  float64
 12  Bathroom       13580 non-null  float64
 13  Car            13580 non-null  float64
 14  Landsize       13580 non-null  float64
 15  BuildingArea   13580 non-null  float64
 16  YearBuilt      13580 non-null  float64
 17  CouncilArea    12211 non-null  object
 18  Lattitude      13580 non-null  float64
 19  Longtitude     13580 non-null  float64
 20  Regionname     13580 non-null  object
 21  Propertycount  13580 non-null  float64
 22  Coordinates    13580 non-null  object
dtypes: float64(11), int64(3), object(9)
memory usage: 2.4+ MB

In [15]:
melb_data['Car'] = melb_data['Car'].astype('int64')
melb_data[['Bedroom','Bathroom']] = melb_data[['Bedroom', 'Bathroom']].astype('int64')
melb_data[['Propertycount', 'YearBuilt']] = melb_data[['Propertycount', 'YearBuilt']].astype('int64')

In [16]:
melb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          13580 non-null  int64
 1   Suburb         13580 non-null  object
 2   Address        13580 non-null  object
 3   Rooms          13580 non-null  int64
 4   Type           13580 non-null  object
 5   Price          13580 non-null  float64
 6   Method         13580 non-null  object
 7   SellerG        13580 non-null  object
 8   Date           13580 non-null  object
 9   Distance       13580 non-null  float64
 10  Postcode       13580 non-null  int64
 11  Bedroom        13580 non-null  int64
 12  Bathroom       13580 non-null  int64
 13  Car            13580 non-null  int64
 14  Landsize       13580 non-null  float64
 15  BuildingArea   13580 non-null  float64
 16  YearBuilt      13580 non-null  int64
 17  CouncilArea    12211 non-null  object
 18  Lattitude      13580 non-null  float64
 19  Longtitude     13580 non-null  float64
 20  Regionname     13580 non-null  object
 21  Propertycount  13580 non-null  int64
 22  Coordinates    13580 non-null  object
dtypes: float64(6), int64(8), object(9)
memory usage: 2.4+ MB

In [17]:
melb_data.describe().loc[:,['Distance', 'BuildingArea', 'Price']]

           Distance  BuildingArea         Price
count  13580.000000  13580.000000  1.358000e+04
mean      10.137776    139.633972  1.075684e+06
std        5.868725    392.217403  6.393107e+05
min        0.000000      0.000000  8.500000e+04
25%        6.100000    122.000000  6.500000e+05
50%        9.200000    126.000000  9.030000e+05
75%       13.000000    129.940000  1.330000e+06
max       48.100000  44515.000000  9.000000e+06

In [18]:
melb_data['Regionname'].value_counts()

Regionname
Southern Metropolitan         4695
Northern Metropolitan         3890
Western Metropolitan          2948
Eastern Metropolitan          1471
South-Eastern Metropolitan     450
Eastern Victoria                53
Northern Victoria               41
Western Victoria                32
Name: count, dtype: int64

In [19]:
melb_data['Regionname'].value_counts(normalize=True)

Regionname
Southern Metropolitan         0.345729
Northern Metropolitan         0.286451
Western Metropolitan          0.217084
Eastern Metropolitan          0.108321
South-Eastern Metropolitan    0.033137
Eastern Victoria              0.003903
Northern Victoria             0.003019
Western Victoria              0.002356
Name: proportion, dtype: float64

In [20]:
print(melb_data['Price'].mean())

1075684.079455081

In [21]:
print(melb_data['Car'].max())

10

In [22]:
rate = 0.12
income = melb_data['Price'].sum() * rate
print('Total income of real estate agencies:', round(income,2))

Total income of real estate agencies: 1752934775.88

In [23]:
landsize_median = melb_data['Landsize'].median()
landsize_mean = melb_data['Landsize'].mean()
print(abs(landsize_median-landsize_mean)/landsize_mean)

0.21205713983546193

In [24]:
print(melb_data['Rooms'].mode())

0    3
Name: Rooms, dtype: int64

In [25]:
print(melb_data['Regionname'].mode())

0    Southern Metropolitan
Name: Regionname, dtype: object

In [26]:
mask = melb_data['Price'] > 2000000
display(mask)

0        False
1        False
2        False
3        False
4        False
         ...
13575    False
13576    False
13577    False
13578     True
13579    False
Name: Price, Length: 13580, dtype: bool

In [27]:
display(melb_data[mask].head())

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
80,80,Albert Park,112 Beaconsfield Pde,3,h,2850000.0,PI,Buxton,4/03/2017,3.3,...,0,211.0,198.0,1890,Port Phillip,-37.8481,144.9499,Southern Metropolitan,3280,"-37.8481, 144.9499"
85,85,Albert Park,104 Richardson St,4,h,2300000.0,S,Marshall,7/05/2016,3.3,...,1,153.0,180.0,1880,Port Phillip,-37.8447,144.9523,Southern Metropolitan,3280,"-37.8447, 144.9523"
88,88,Albert Park,29 Faussett St,2,h,2120000.0,S,Greg,10/09/2016,3.3,...,1,199.0,107.0,1900,Port Phillip,-37.8422,144.9554,Southern Metropolitan,3280,"-37.8422, 144.9554"
92,92,Albert Park,2 Dundas Pl,3,h,2615000.0,S,Cayzer,10/12/2016,3.3,...,1,177.0,181.0,1880,Port Phillip,-37.8415,144.9585,Southern Metropolitan,3280,"-37.8415, 144.9585"
93,93,Albert Park,23 Finlay St,5,h,2100000.0,S,Greg,10/12/2016,3.3,...,1,237.0,126.0,1970,Port Phillip,-37.8436,144.9557,Southern Metropolitan,3280,"-37.8436, 144.9557"

In [28]:
melb_data[melb_data['Rooms'] == 3].shape[0]

5881

In [29]:
melb_data[(melb_data['Rooms'] == 3) & (melb_data['Price'] < 300000)].shape[0]

3

In [30]:
melb_data[((melb_data['Rooms'] == 3) | (melb_data['BuildingArea'] > 100)) & (melb_data['Price'] < 300000)].shape[0]

68

In [31]:
print(melb_data[melb_data['Type'] == 't']['Rooms'].max())

5

In [32]:
mean_price = melb_data['Price'].mean()
print(melb_data[melb_data['Price'] > mean_price]['BuildingArea'].median())

126.0

In [33]:
import pandas as pd
melb_data = pd.read_csv('data/melb_data.csv', sep=',')

In [34]:
melb_df = melb_data.copy()
melb_df.head()

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
0,0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,...,1.0,202.0,126.0,1970.0,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0,"-37.7996, 144.9984"
1,1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,...,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0,"-37.8079, 144.9934"
2,2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,...,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0,"-37.8093, 144.9944"
3,3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,...,1.0,94.0,126.0,1970.0,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0,"-37.7969, 144.9969"
4,4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,...,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0,"-37.8072, 144.9941"

In [35]:
melb_df = melb_df.drop(['index', 'Coordinates'], axis=1)
melb_df.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067,...,1.0,1.0,202.0,126.0,1970.0,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067,...,2.0,1.0,94.0,126.0,1970.0,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0

In [36]:
total_rooms = melb_df['Rooms'] + melb_df['Bedroom'] + melb_df['Bathroom']
display(total_rooms)

0         5.0
1         5.0
2         8.0
3         8.0
4         8.0
         ...
13575    10.0
13576     8.0
13577     8.0
13578     9.0
13579     9.0
Length: 13580, dtype: float64

In [37]:
melb_df['MeanRoomsArea'] = melb_df['BuildingArea'] / total_rooms
display(melb_df['MeanRoomsArea'])

0        25.200000
1        15.800000
2        18.750000
3        15.750000
4        17.750000
           ...
13575    12.600000
13576    16.625000
13577    15.750000
13578    17.444444
13579    12.444444
Name: MeanRoomsArea, Length: 13580, dtype: float64

In [38]:
diff_area = melb_df['BuildingArea'] - melb_df['Landsize']
sum_area = melb_df['BuildingArea'] + melb_df['Landsize']
melb_df['AreaRatio'] = diff_area/sum_area
display(melb_df['AreaRatio'])

0       -0.231707
1       -0.327660
2        0.056338
3        0.145455
4        0.083969
           ...
13575   -0.676093
13576   -0.429185
13577   -0.551601
13578   -0.693060
13579   -0.527426
Name: AreaRatio, Length: 13580, dtype: float64

In [39]:
melb_df['Date'] = pd.to_datetime(melb_df['Date'], dayfirst=True)
display(melb_df['Date'])

0       2016-12-03
1       2016-02-04
2       2017-03-04
3       2017-03-04
4       2016-06-04
           ...
13575   2017-08-26
13576   2017-08-26
13577   2017-08-26
13578   2017-08-26
13579   2017-08-26
Name: Date, Length: 13580, dtype: datetime64[ns]

In [40]:
years_sold = melb_df['Date'].dt.year
print(years_sold)
print('Min year sold:', years_sold.min())
print('Max year sold:', years_sold.max())
print('Mode year sold:', years_sold.mode()[0])

0        2016
1        2016
2        2017
3        2017
4        2016
         ...
13575    2017
13576    2017
13577    2017
13578    2017
13579    2017
Name: Date, Length: 13580, dtype: int32
Min year sold: 2016
Max year sold: 2017
Mode year sold: 2017

In [41]:
melb_df['MonthSale'] = melb_df['Date'].dt.month
melb_df['MonthSale'].value_counts(normalize=True)

MonthSale
5     0.149411
7     0.145950
9     0.135862
6     0.134757
8     0.114138
11    0.082032
4     0.069882
3     0.049926
12    0.044698
10    0.040574
2     0.032622
1     0.000147
Name: proportion, dtype: float64

In [42]:
delta_days = melb_df['Date'] - pd.to_datetime('2016-01-01')
display(delta_days)

0       337 days
1        34 days
2       428 days
3       428 days
4       155 days
          ...
13575   603 days
13576   603 days
13577   603 days
13578   603 days
13579   603 days
Name: Date, Length: 13580, dtype: timedelta64[ns]

In [43]:
print(delta_days.dt.days)

0        337
1         34
2        428
3        428
4        155
        ...
13575    603
13576    603
13577    603
13578    603
13579    603
Name: Date, Length: 13580, dtype: int64

In [44]:
melb_df['AgeBuilding'] = melb_df['Date'].dt.year - melb_df['YearBuilt']
display(melb_df['AgeBuilding'])

0         46.0
1        116.0
2        117.0
3         47.0
4          2.0
         ...
13575     36.0
13576     22.0
13577     20.0
13578     97.0
13579     97.0
Name: AgeBuilding, Length: 13580, dtype: float64

In [45]:
melb_df = melb_df.drop('YearBuilt', axis =1)

In [46]:
melb_df['WeekdaySale'] = melb_df['Date'].dt.day_of_week
print(melb_df['WeekdaySale'])

0        5
1        3
2        5
3        5
4        5
        ..
13575    5
13576    5
13577    5
13578    5
13579    5
Name: WeekdaySale, Length: 13580, dtype: int32

In [47]:
weekend_count = melb_df[(melb_df['WeekdaySale']== 5) | (melb_df['WeekdaySale'] == 6)]['WeekdaySale'].count()
print(weekend_count)

12822

In [ ]:
ufo_data = pd.read_csv('data/ufo.csv', sep=',')
print(ufo_data.head())

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [ ]:
print(ufo_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18215 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB
None

In [ ]:
ufo_data['Time'] = pd.to_datetime(ufo_data['Time'])
print(ufo_data['Time'].head())

0   1930-06-01 22:00:00
1   1930-06-30 20:00:00
2   1931-02-15 14:00:00
3   1931-06-01 13:00:00
4   1933-04-18 19:00:00
Name: Time, dtype: datetime64[ns]

In [ ]:
ufo_years = ufo_data['Time'].dt.year
print(ufo_years.value_counts().index[0])

1999

In [ ]:
ufo_data['Date'] = ufo_data['Time'].dt.date
print(ufo_data['Date'])

0        1930-06-01
1        1930-06-30
2        1931-02-15
3        1931-06-01
4        1933-04-18
            ...
18236    2000-12-31
18237    2000-12-31
18238    2000-12-31
18239    2000-12-31
18240    2000-12-31
Name: Date, Length: 18241, dtype: object

In [ ]:
print(ufo_data['State'].unique())

['NY' 'NJ' 'CO' 'KS' 'ND' 'CA' 'MI' 'AK' 'OR' 'AL' 'SC' 'IA' 'GA' 'TN'
 'NE' 'LA' 'KY' 'WV' 'NM' 'UT' 'RI' 'FL' 'VA' 'NC' 'TX' 'WA' 'ME' 'IL'
 'AZ' 'OH' 'PA' 'MN' 'WI' 'MD' 'SD' 'NV' 'ID' 'MO' 'OK' 'IN' 'CT' 'MS'
 'AR' 'WY' 'MA' 'MT' 'DE' 'NH' 'VT' 'HI' 'Ca' 'Fl']

In [ ]:
nv_diff = ufo_data[ufo_data['State'] == 'NV']['Date'].diff()

In [ ]:
print(nv_diff.dt.days.mean())

68.92932862190813

In [ ]:
def get_street_type(address):
    exclude_list = ['N', 'S', 'W', 'E']
    address_list = address.split(' ')
    street_type = address_list[-1]
    if street_type in exclude_list:
        street_type = address_list[-2]
    return street_type

In [ ]:
street_types = melb_df['Address'].apply(get_street_type)
display(street_types)

0        St
1        St
2        St
3        La
4        St
         ..
13575    Cr
13576    Dr
13577    St
13578    St
13579    St
Name: Address, Length: 13580, dtype: object

In [ ]:
def reduce_street_type_name(street_type: str) -> str:
    type_dict = {'Avenue': 'Av', 'Ave': 'Av', 'Boulevard': 'Bvd', 'Parade': 'Pde'}
    for long_type, short_type in type_dict.items():
        if street_type == long_type:
            street_type = short_type
    return street_type

In [ ]:
street_types = street_types.apply(reduce_street_type_name)

In [ ]:
print(street_types.unique())

['St' 'La' 'Rd' 'Gr' 'Ct' 'Dr' 'Pde' 'Pl' 'Hwy' 'Tce' 'Bvd' 'Highway' 'Cl'
 'Athol' 'Grove' 'Cct' 'Av' 'Righi' 'Esp' 'Crescent' 'Cir' 'Crossway'
 'Grange' 'Sq' 'Res' 'Esplanade' 'Strand' 'Cove' 'Mews' 'Crofts' 'Qy'
 'Glade' 'Nook' 'Gdns' 'Victoria' 'Fairway' 'Terrace' 'Ridge' 'Loop'
 'East' 'Dell' 'Eyrie' 'Grn' 'Gra' 'Grand' 'Summit' 'Cr' 'Wy' 'Hts'
 'Outlook' 'Woodland' 'Corso']

In [ ]:
display(street_types.value_counts())

Address
St           8012
Rd           2825
Ct            612
Dr            447
Av            362
Gr            311
Pde           226
Pl            169
Cr            152
Cl            100
La             67
Bvd            66
Tce            47
Wy             40
Cct            25
Hwy            24
Sq             11
Crescent        9
Cir             7
Strand          7
Esplanade       6
Grove           5
Gdns            4
Fairway         4
Mews            4
Grn             4
Crossway        3
Righi           3
Ridge           2
Crofts          2
Esp             2
Victoria        2
Athol           1
Highway         1
Grange          1
Res             1
Nook            1
Glade           1
Qy              1
Cove            1
East            1
Dell            1
Loop            1
Terrace         1
Gra             1
Eyrie           1
Summit          1
Grand           1
Hts             1
Outlook         1
Woodland        1
Corso           1
Name: count, dtype: int64

In [ ]:
popular_types = street_types.value_counts().nlargest(10).index
print(popular_types)

Index(['St', 'Rd', 'Ct', 'Dr', 'Av', 'Gr', 'Pde', 'Pl', 'Cr', 'Cl'], dtype='object', name='Address')

In [ ]:
melb_df['StreetType'] = street_types.apply(lambda x: x if x in popular_types else 'other')
display(melb_df['StreetType'])

0           St
1           St
2           St
3        other
4           St
         ...
13575       Cr
13576       Dr
13577       St
13578       St
13579       St
Name: StreetType, Length: 13580, dtype: object

In [ ]:
print(melb_df['StreetType'].nunique())

11

In [ ]:
melb_df = melb_df.drop('Address', axis=1)

In [ ]:
melb_df.head()

,Suburb,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom,...,Lattitude,Longtitude,Regionname,Propertycount,MeanRoomsArea,AreaRatio,MonthSale,AgeBuilding,WeekdaySale,StreetType
0,Abbotsford,2,h,1480000.0,S,Biggin,2016-12-03,2.5,3067,2.0,...,-37.7996,144.9984,Northern Metropolitan,4019.0,25.20,-0.231707,12,46.0,5,St
1,Abbotsford,2,h,1035000.0,S,Biggin,2016-02-04,2.5,3067,2.0,...,-37.8079,144.9934,Northern Metropolitan,4019.0,15.80,-0.327660,2,116.0,3,St
2,Abbotsford,3,h,1465000.0,SP,Biggin,2017-03-04,2.5,3067,3.0,...,-37.8093,144.9944,Northern Metropolitan,4019.0,18.75,0.056338,3,117.0,5,St
3,Abbotsford,3,h,850000.0,PI,Biggin,2017-03-04,2.5,3067,3.0,...,-37.7969,144.9969,Northern Metropolitan,4019.0,15.75,0.145455,3,47.0,5,other
4,Abbotsford,4,h,1600000.0,VB,Nelson,2016-06-04,2.5,3067,3.0,...,-37.8072,144.9941,Northern Metropolitan,4019.0,17.75,0.083969,6,2.0,5,St

In [ ]:
def get_weekend(weekend:int) -> int:
    if weekend == 5 or weekend == 6:
        return 1
    return 0

In [ ]:
melb_df['Weekend'] = melb_df['WeekdaySale'].apply(get_weekend)

In [ ]:
print(melb_df['Weekend'].head())

0    1
1    0
2    1
3    1
4    1
Name: Weekend, dtype: int64

In [ ]:
print(round(melb_df[melb_df['Weekend'] == 1]['Price'].mean(), 0))

1081199.0

In [ ]:
popular_sellers = melb_df['SellerG'].value_counts().nlargest(49).index

In [ ]:
print(popular_sellers)

Index(['Nelson', 'Jellis', 'hockingstuart', 'Barry', 'Ray', 'Marshall',
       'Buxton', 'Biggin', 'Brad', 'Fletchers', 'Woodards', 'Jas', 'Greg',
       'McGrath', 'Sweeney', 'Noel', 'Miles', 'RT', 'Gary', 'Harcourts',
       'Hodges', 'YPA', 'Stockdale', 'Village', 'Kay', 'Raine', 'Williams',
       'Love', 'Douglas', 'Chisholm', 'RW', 'Rendina', 'HAR', 'O'Brien', 'C21',
       'Collins', 'Cayzer', 'Purplebricks', 'Eview', 'Philip', 'Buckingham',
       'Bells', 'Thomson', 'Nick', 'Alexkarbon', 'Burnham', 'McDonald',
       'Moonee', 'LITTLE'],
      dtype='object', name='SellerG')

In [ ]:
def group_sellers(seller:str) -> str:
    global popular_sellers
    if seller not in popular_sellers:
        return 'other'
    return seller

In [ ]:
melb_df['SellerG'] = melb_df['SellerG'].apply(group_sellers)

In [ ]:
print(melb_df['SellerG'].value_counts())

SellerG
Nelson           1565
Jellis           1316
other            1199
hockingstuart    1167
Barry            1011
Ray               701
Marshall          659
Buxton            632
Biggin            393
Brad              342
Fletchers         301
Woodards          301
Jas               243
Greg              239
McGrath           222
Sweeney           216
Noel              205
Miles             196
RT                184
Gary              170
Harcourts         168
Hodges            157
YPA               154
Stockdale         150
Village           125
Kay               119
Raine             116
Williams          111
Love              109
Douglas            97
Chisholm           77
RW                 70
Rendina            66
HAR                62
O'Brien            61
C21                57
Collins            56
Cayzer             52
Purplebricks       51
Eview              51
Philip             48
Buckingham         46
Bells              44
Thomson            42
Nick               40
Alexkarbon         40
Burnham            39
McDonald           39
Moonee             36
LITTLE             35
Name: count, dtype: int64

In [ ]:
print((melb_df[melb_df['SellerG'] == 'Nelson']['Price'].min()) / (melb_df[melb_df['SellerG'] == 'other']['Price'].min()))

1.297709923664122

In [ ]:
unique_list = []

In [ ]:
for col in melb_df.columns:
    item = (col, melb_df[col].nunique(), melb_df[col].dtypes)
    unique_list.append(item)

unique_counts = pd.DataFrame(
    unique_list,
    columns=['Column_name', 'Num_Unique', 'Type']
).sort_values(by='Num_Unique', ignore_index=True)

display(unique_counts)

      Column_name  Num_Unique            Type
0         Weekend           2           int64
1            Type           3          object
2     WeekdaySale           5           int32
3          Method           5          object
4      Regionname           8          object
5           Rooms           9           int64
6        Bathroom           9         float64
7             Car          11         float64
8      StreetType          11          object
9         Bedroom          12         float64
10      MonthSale          12           int32
11    CouncilArea          33          object
12        SellerG          50          object
13           Date          58  datetime64[ns]
14    AgeBuilding         152         float64
15       Postcode         198           int64
16       Distance         202         float64
17  Propertycount         311         float64
18         Suburb         314          object
19   BuildingArea         602         float64
20  MeanRoomsArea        1277         float64
21       Landsize        1448         float64
22          Price        2204         float64
23      Lattitude        6503         float64
24      AreaRatio        6521         float64
25     Longtitude        7063         float64

In [ ]:
cols_to_exclude = ['Date', 'Rooms', 'Bedroom', 'Bathroom', 'Car']
max_unique_count = 150
for col in melb_df.columns:
    if melb_df[col].nunique() < max_unique_count and col not in cols_to_exclude:
        melb_df[col] = melb_df[col].astype('category')

display(melb_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 26 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Suburb         13580 non-null  object
 1   Rooms          13580 non-null  int64
 2   Type           13580 non-null  category
 3   Price          13580 non-null  float64
 4   Method         13580 non-null  category
 5   SellerG        13580 non-null  category
 6   Date           13580 non-null  datetime64[ns]
 7   Distance       13580 non-null  float64
 8   Postcode       13580 non-null  int64
 9   Bedroom        13580 non-null  float64
 10  Bathroom       13580 non-null  float64
 11  Car            13580 non-null  float64
 12  Landsize       13580 non-null  float64
 13  BuildingArea   13580 non-null  float64
 14  CouncilArea    12211 non-null  category
 15  Lattitude      13580 non-null  float64
 16  Longtitude     13580 non-null  float64
 17  Regionname     13580 non-null  category
 18  Propertycount  13580 non-null  float64
 19  MeanRoomsArea  13580 non-null  float64
 20  AreaRatio      13580 non-null  float64
 21  MonthSale      13580 non-null  category
 22  AgeBuilding    13580 non-null  float64
 23  WeekdaySale    13580 non-null  category
 24  StreetType     13580 non-null  category
 25  Weekend        13580 non-null  category
dtypes: category(9), datetime64[ns](1), float64(13), int64(2), object(1)
memory usage: 1.9+ MB

None

In [ ]:
print(melb_df['Regionname'].cat.categories)

Index(['Eastern Metropolitan', 'Eastern Victoria', 'Northern Metropolitan',
       'Northern Victoria', 'South-Eastern Metropolitan',
       'Southern Metropolitan', 'Western Metropolitan', 'Western Victoria'],
      dtype='object')

In [ ]:
display(melb_df['Regionname'].cat.codes)

0        2
1        2
2        2
3        2
4        2
        ..
13575    4
13576    6
13577    6
13578    6
13579    6
Length: 13580, dtype: int8

In [ ]:
melb_df['Type'] = melb_df['Type'].cat.rename_categories({
    'u': 'unit',
    't': 'townhouse',
    'h': 'house'
})
display(melb_df['Type'])

0        house
1        house
2        house
3        house
4        house
         ...
13575    house
13576    house
13577    house
13578    house
13579    house
Name: Type, Length: 13580, dtype: category
Categories (3, object): ['house', 'townhouse', 'unit']

In [ ]:
print(melb_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 26 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Suburb         13580 non-null  object
 1   Rooms          13580 non-null  int64
 2   Type           13580 non-null  category
 3   Price          13580 non-null  float64
 4   Method         13580 non-null  category
 5   SellerG        13580 non-null  category
 6   Date           13580 non-null  datetime64[ns]
 7   Distance       13580 non-null  float64
 8   Postcode       13580 non-null  int64
 9   Bedroom        13580 non-null  float64
 10  Bathroom       13580 non-null  float64
 11  Car            13580 non-null  float64
 12  Landsize       13580 non-null  float64
 13  BuildingArea   13580 non-null  float64
 14  CouncilArea    12211 non-null  category
 15  Lattitude      13580 non-null  float64
 16  Longtitude     13580 non-null  float64
 17  Regionname     13580 non-null  category
 18  Propertycount  13580 non-null  float64
 19  MeanRoomsArea  13580 non-null  float64
 20  AreaRatio      13580 non-null  float64
 21  MonthSale      13580 non-null  category
 22  AgeBuilding    13580 non-null  float64
 23  WeekdaySale    13580 non-null  category
 24  StreetType     13580 non-null  category
 25  Weekend        13580 non-null  category
dtypes: category(9), datetime64[ns](1), float64(13), int64(2), object(1)
memory usage: 1.9+ MB
None

In [ ]:
print(len(melb_df['Suburb'].unique()))

314

In [ ]:
popular_suburbs = melb_df['Suburb'].value_counts().nlargest(119)

In [ ]:
def convert_suburbs(suburb:str) -> str:
    global popular_suburbs
    if suburb not in popular_suburbs:
        return 'other'
    return suburb

In [ ]:
melb_df['Suburb'] = melb_df['Suburb'].apply(convert_suburbs)

In [ ]:
print(len(melb_df['Suburb'].unique()))

120

In [ ]:
melb_df['Suburb'] = melb_df['Suburb'].astype('category')

In [ ]:
print(melb_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 26 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Suburb         13580 non-null  category
 1   Rooms          13580 non-null  int64
 2   Type           13580 non-null  category
 3   Price          13580 non-null  float64
 4   Method         13580 non-null  category
 5   SellerG        13580 non-null  category
 6   Date           13580 non-null  datetime64[ns]
 7   Distance       13580 non-null  float64
 8   Postcode       13580 non-null  int64
 9   Bedroom        13580 non-null  float64
 10  Bathroom       13580 non-null  float64
 11  Car            13580 non-null  float64
 12  Landsize       13580 non-null  float64
 13  BuildingArea   13580 non-null  float64
 14  CouncilArea    12211 non-null  category
 15  Lattitude      13580 non-null  float64
 16  Longtitude     13580 non-null  float64
 17  Regionname     13580 non-null  category
 18  Propertycount  13580 non-null  float64
 19  MeanRoomsArea  13580 non-null  float64
 20  AreaRatio      13580 non-null  float64
 21  MonthSale      13580 non-null  category
 22  AgeBuilding    13580 non-null  float64
 23  WeekdaySale    13580 non-null  category
 24  StreetType     13580 non-null  category
 25  Weekend        13580 non-null  category
dtypes: category(10), datetime64[ns](1), float64(13), int64(2)
memory usage: 1.8 MB
None

In [ ]:
import pandas as pd
melb_df = pd.read_csv('data/melb_data_fe.csv')
display(melb_df.head())

,Suburb,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom,...,Longtitude,Regionname,Propertycount,MeanRoomsSquare,AreaRatio,MonthSale,AgeBuilding,WeekdaySale,StreetType,Weekend
0,Abbotsford,2,house,1480000.0,S,Biggin,2016-03-12,2.5,3067,2,...,144.9984,Northern Metropolitan,4019,25.20,-0.231707,3,46,5,St,1
1,Abbotsford,2,house,1035000.0,S,Biggin,2016-04-02,2.5,3067,2,...,144.9934,Northern Metropolitan,4019,15.80,-0.327660,4,116,5,St,1
2,Abbotsford,3,house,1465000.0,SP,Biggin,2017-04-03,2.5,3067,3,...,144.9944,Northern Metropolitan,4019,18.75,0.056338,4,117,0,St,0
3,Abbotsford,3,house,850000.0,PI,Biggin,2017-04-03,2.5,3067,3,...,144.9969,Northern Metropolitan,4019,15.75,0.145455,4,47,0,other,0
4,Abbotsford,4,house,1600000.0,VB,Nelson,2016-04-06,2.5,3067,3,...,144.9941,Northern Metropolitan,4019,17.75,0.083969,4,2,2,St,0

In [ ]:
print(melb_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 26 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Suburb           13580 non-null  object
 1   Rooms            13580 non-null  int64
 2   Type             13580 non-null  object
 3   Price            13580 non-null  float64
 4   Method           13580 non-null  object
 5   SellerG          13580 non-null  object
 6   Date             13580 non-null  object
 7   Distance         13580 non-null  float64
 8   Postcode         13580 non-null  int64
 9   Bedroom          13580 non-null  int64
 10  Bathroom         13580 non-null  int64
 11  Car              13580 non-null  int64
 12  Landsize         13580 non-null  float64
 13  BuildingArea     13580 non-null  float64
 14  CouncilArea      12211 non-null  object
 15  Lattitude        13580 non-null  float64
 16  Longtitude       13580 non-null  float64
 17  Regionname       13580 non-null  object
 18  Propertycount    13580 non-null  int64
 19  MeanRoomsSquare  13580 non-null  float64
 20  AreaRatio        13580 non-null  float64
 21  MonthSale        13580 non-null  int64
 22  AgeBuilding      13580 non-null  int64
 23  WeekdaySale      13580 non-null  int64
 24  StreetType       13580 non-null  object
 25  Weekend          13580 non-null  int64
dtypes: float64(8), int64(10), object(8)
memory usage: 2.7+ MB
None

In [ ]:
melb_df['Date'] = pd.to_datetime(melb_df['Date'], yearfirst=True)

In [ ]:
print(melb_df['Date'].dt.quarter.value_counts().iloc[1])

4359

In [ ]:
print(dict(melb_df.nunique()))

{'Suburb': np.int64(120), 'Rooms': np.int64(9), 'Type': np.int64(3), 'Price': np.int64(2204), 'Method': np.int64(5), 'SellerG': np.int64(50), 'Date': np.int64(58), 'Distance': np.int64(202), 'Postcode': np.int64(198), 'Bedroom': np.int64(12), 'Bathroom': np.int64(9), 'Car': np.int64(11), 'Landsize': np.int64(1448), 'BuildingArea': np.int64(602), 'CouncilArea': np.int64(33), 'Lattitude': np.int64(6503), 'Longtitude': np.int64(7063), 'Regionname': np.int64(8), 'Propertycount': np.int64(311), 'MeanRoomsSquare': np.int64(1275), 'AreaRatio': np.int64(6521), 'MonthSale': np.int64(12), 'AgeBuilding': np.int64(152), 'WeekdaySale': np.int64(7), 'StreetType': np.int64(11), 'Weekend': np.int64(2)}

In [ ]:
count_unique_values = dict(melb_df.nunique())
cols_to_exclude = ['Date', 'Rooms', 'Bedroom', 'Bathroom', 'Car']

def convert_to_category(df:pd.DataFrame) -> pd.DataFrame:
    global count_unique_values
    global cols_to_exclude
    for col_name, n in count_unique_values.items():
        if n < 150 and col_name not in cols_to_exclude:
            df[col_name] = df[col_name].astype('category')
    return df

melb_df = convert_to_category(melb_df)

In [ ]:
print(melb_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 26 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Suburb           13580 non-null  category
 1   Rooms            13580 non-null  int64
 2   Type             13580 non-null  category
 3   Price            13580 non-null  float64
 4   Method           13580 non-null  category
 5   SellerG          13580 non-null  category
 6   Date             13580 non-null  datetime64[ns]
 7   Distance         13580 non-null  float64
 8   Postcode         13580 non-null  int64
 9   Bedroom          13580 non-null  int64
 10  Bathroom         13580 non-null  int64
 11  Car              13580 non-null  int64
 12  Landsize         13580 non-null  float64
 13  BuildingArea     13580 non-null  float64
 14  CouncilArea      12211 non-null  category
 15  Lattitude        13580 non-null  float64
 16  Longtitude       13580 non-null  float64
 17  Regionname       13580 non-null  category
 18  Propertycount    13580 non-null  int64
 19  MeanRoomsSquare  13580 non-null  float64
 20  AreaRatio        13580 non-null  float64
 21  MonthSale        13580 non-null  category
 22  AgeBuilding      13580 non-null  int64
 23  WeekdaySale      13580 non-null  category
 24  StreetType       13580 non-null  category
 25  Weekend          13580 non-null  category
dtypes: category(10), datetime64[ns](1), float64(8), int64(7)
memory usage: 1.8 MB
None

In [ ]:
mask1 = melb_df['AreaRatio'] < -0.8
mask2 = melb_df['Type'] == 'townhouse'
mask3 = melb_df['SellerG'] == 'McGrath'
melb_df[mask1 & mask2 & mask3].sort_values(
    by=['Date', 'AreaRatio'],
    ascending=[True, False],
    ignore_index=True
).loc[:,['Date', 'AreaRatio']]

        Date  AreaRatio
0 2016-07-26  -0.974922
1 2016-09-24  -0.971831
2 2016-11-27  -0.953608
3 2016-12-11  -0.945946
4 2017-08-04  -0.947368
5 2017-08-04  -0.970874

In [ ]:
print(melb_df.sort_values(by='AreaRatio', ascending=False, ignore_index=True)['BuildingArea'].loc[1558])

77.0

In [ ]:
print(melb_df.groupby(by='Type').mean(numeric_only=True))

              Rooms         Price   Distance     Postcode   Bedroom  Bathroom  \
Type
house      3.260874  1.242665e+06  10.979479  3104.080643  3.229336  1.613822
townhouse  2.837522  9.337351e+05   9.851346  3100.777379  2.814183  1.809695
unit       1.963871  6.051275e+05   7.607391  3110.797481  1.966523  1.183295

                Car    Landsize  BuildingArea  Lattitude  Longtitude  \
Type
house      1.772674  617.181924    152.162553 -37.803795  144.994700
townhouse  1.555655  279.606822    134.649710 -37.815782  144.996489
unit       1.128936  477.314219    102.235863 -37.823710  144.996363

           Propertycount  MeanRoomsSquare  AreaRatio  AgeBuilding
Type
house        7259.025505        18.996731  -0.490031    55.669700
townhouse    7094.459605        18.569847  -0.094916    26.690305
unit         8199.280080        21.068242   0.319883    39.703016

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\378663239.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print(melb_df.groupby(by='Type').mean(numeric_only=True))

In [ ]:
print(melb_df.groupby('Type')['Price'].mean())

Type
house        1.242665e+06
townhouse    9.337351e+05
unit         6.051275e+05
Name: Price, dtype: float64

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\2486661396.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print(melb_df.groupby('Type')['Price'].mean())

In [ ]:
display(melb_df.groupby('Regionname')['Distance'].min().sort_values(ascending=False))

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\4162040259.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  display(melb_df.groupby('Regionname')['Distance'].min().sort_values(ascending=False))

Regionname
Western Victoria              29.8
Eastern Victoria              25.2
Northern Victoria             21.8
South-Eastern Metropolitan    14.7
Eastern Metropolitan           7.8
Western Metropolitan           4.3
Southern Metropolitan          0.7
Northern Metropolitan          0.0
Name: Distance, dtype: float64

In [ ]:
print(melb_df.groupby('MonthSale')['Price'].agg(
    ['count', 'mean', 'max']
).sort_values(by='count', ascending=False))

           count          mean        max
MonthSale
8           1850  1.056371e+06  6500000.0
7           1835  9.314698e+05  9000000.0
5           1644  1.097807e+06  8000000.0
6           1469  1.068981e+06  7650000.0
3           1408  1.146762e+06  5600000.0
4           1246  1.050479e+06  5500000.0
9           1188  1.126349e+06  6400000.0
10           854  1.135970e+06  6250000.0
11           750  1.142503e+06  5050000.0
12           725  1.144737e+06  5700000.0
2            333  1.169051e+06  4735000.0
1            278  9.397921e+05  5200000.0

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\1732898069.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print(melb_df.groupby('MonthSale')['Price'].agg(

In [ ]:
melb_df.groupby('Regionname')['SellerG'].agg(['nunique', set])

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\4026196115.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  melb_df.groupby('Regionname')['SellerG'].agg(['nunique', set])

,nunique,set
Regionname,,
Eastern Metropolitan,26,"{Jellis, other, Noel, HAR, Buxton, Philip, C21..."
Eastern Victoria,11,"{Ray, Barry, other, O'Brien, HAR, Eview, hocki..."
Northern Metropolitan,40,"{Jellis, LITTLE, other, Burnham, Cayzer, Jas, ..."
Northern Victoria,11,"{Ray, Barry, other, LITTLE, YPA, Buckingham, h..."
South-Eastern Metropolitan,25,"{Jellis, other, Noel, O'Brien, HAR, Eview, Bux..."
Southern Metropolitan,38,"{Jellis, other, LITTLE, Cayzer, Noel, O'Brien,..."
Western Metropolitan,34,"{Jellis, other, Burnham, Jas, HAR, O'Brien, Wi..."
Western Victoria,6,"{Ray, other, YPA, HAR, hockingstuart, Raine}"

In [ ]:
melb_df.groupby('Rooms')['Price'].agg(['mean']).sort_values('mean')

               mean
Rooms
1      4.338245e+05
2      7.750812e+05
10     9.000000e+05
3      1.076081e+06
4      1.445282e+06
8      1.602750e+06
6      1.849366e+06
5      1.870260e+06
7      1.920700e+06

In [ ]:
print(melb_df.groupby('Regionname')['Lattitude'].agg(['std']).sort_values('std').index[0])

Western Victoria

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\347112379.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print(melb_df.groupby('Regionname')['Lattitude'].agg(['std']).sort_values('std').index[0])

In [ ]:
print(melb_df[('2017-05-01' <= melb_df['Date']) & (melb_df['Date'] <= '2017-09-01')].groupby('SellerG')['Price'].agg(['sum']).sort_values('sum'))

                       sum
SellerG
LITTLE           2742000.0
Cayzer           4439000.0
Burnham          4550500.0
Moonee           7328000.0
Thomson          8332000.0
Bells            8656000.0
Alexkarbon      10985000.0
McDonald        14637500.0
Rendina         15422276.0
Nick            16890000.0
Douglas         18341000.0
Buckingham      19033000.0
C21             19515000.0
Eview           19791500.0
Collins         20217000.0
Philip          22051800.0
Chisholm        23225000.0
Williams        23297000.0
Love            23365500.0
Purplebricks    23401000.0
O'Brien         23855508.0
HAR             25568000.0
Village         26473000.0
RW              29261000.0
Raine           30687700.0
Stockdale       35409800.0
Sweeney         36882750.0
Gary            39138400.0
Hodges          43231000.0
YPA             46354350.0
Miles           47582000.0
Kay             48569500.0
RT              50498000.0
Brad            55955000.0
Jas             59281600.0
Harcourts       68720250.0
McGrath         78386500.0
Greg            85621000.0
Woodards        85977500.0
Noel            88129800.0
Fletchers      108847700.0
Biggin         110429500.0
Buxton         219104000.0
Ray            249572986.0
Marshall       253957888.0
hockingstuart  282834310.0
Barry          296723050.0
other          365038432.0
Nelson         379767500.0
Jellis         414121833.0

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\2086735462.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print(melb_df[('2017-05-01' <= melb_df['Date']) & (melb_df['Date'] <= '2017-09-01')].groupby('SellerG')['Price'].agg(['sum']).sort_values('sum'))

In [ ]:
display(melb_df.groupby('Rooms')[['Price', 'BuildingArea']].median())

           Price  BuildingArea
Rooms
1       385000.0         107.0
2       690000.0         126.0
3       950000.0         126.0
4      1285000.0         142.0
5      1660000.0         176.0
6      1800000.0         126.0
7      1496000.0         216.5
8      1515000.0         126.0
10      900000.0         126.0

In [ ]:
melb_df.pivot_table(
    values='Price',
    index='Rooms',
    columns='Type',
    fill_value=0    
).round()

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\2575471317.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  melb_df.pivot_table(

Type       house  townhouse       unit
Rooms
1       866866.0   592705.0   389929.0
2      1017238.0   710158.0   610491.0
3      1109233.0   984709.0   850596.0
4      1462283.0  1217092.0  1037476.0
5      1877327.0  1035000.0        0.0
6      1869508.0        0.0   520000.0
7      1920700.0        0.0        0.0
8      1510286.0        0.0  2250000.0
10      900000.0        0.0        0.0

In [ ]:
melb_df.pivot_table(
    values='Price',
    index='Regionname',
    columns='Weekend',
    aggfunc='count'
)

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\2049665855.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  melb_df.pivot_table(

Weekend                        0     1
Regionname
Eastern Metropolitan         447  1024
Eastern Victoria              13    40
Northern Metropolitan       1258  2632
Northern Victoria             11    30
South-Eastern Metropolitan   123   327
Southern Metropolitan       1534  3161
Western Metropolitan         960  1988
Western Victoria               8    24

In [ ]:
melb_df.pivot_table(
    values='Landsize',
    index='Regionname',
    columns='Type',
    aggfunc=['median', 'mean'],
    fill_value=0
)

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\186795090.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  melb_df.pivot_table(
C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\186795090.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  melb_df.pivot_table(

                           median                          mean              \
Type                        house townhouse   unit        house   townhouse
Regionname
Eastern Metropolitan        674.0     233.5  203.0   717.422847  269.440678
Eastern Victoria            843.0       0.0  230.0  3108.960000    0.000000
Northern Metropolitan       459.5     134.0    0.0   619.249092  317.325733
Northern Victoria           724.0       0.0    0.0  3355.463415    0.000000
South-Eastern Metropolitan  630.5     240.0  199.0   664.306701  212.160000
Southern Metropolitan       586.0     246.0    0.0   569.643881  278.858824
Western Metropolitan        531.0     198.0   62.0   507.883406  244.560669
Western Victoria            599.5       0.0    0.0   655.500000    0.000000


Type                              unit
Regionname
Eastern Metropolitan        330.444444
Eastern Victoria            295.333333
Northern Metropolitan       495.026538
Northern Victoria             0.000000
South-Eastern Metropolitan  357.864865
Southern Metropolitan       466.380245
Western Metropolitan        557.637232
Western Victoria              0.000000

In [ ]:
pivot = melb_df.pivot_table(
    values='Landsize',
    index='Regionname',
    columns='Type',
    aggfunc=['median', 'mean'],
    fill_value=0
)

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\1672652905.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot = melb_df.pivot_table(
C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\1672652905.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot = melb_df.pivot_table(

In [ ]:
pivot.columns

MultiIndex([('median',     'house'),
            ('median', 'townhouse'),
            ('median',      'unit'),
            (  'mean',     'house'),
            (  'mean', 'townhouse'),
            (  'mean',      'unit')],
           names=[None, 'Type'])

In [ ]:
display(pivot['mean']['unit'])

Regionname
Eastern Metropolitan          330.444444
Eastern Victoria              295.333333
Northern Metropolitan         495.026538
Northern Victoria               0.000000
South-Eastern Metropolitan    357.864865
Southern Metropolitan         466.380245
Western Metropolitan          557.637232
Western Victoria                0.000000
Name: unit, dtype: float64

In [ ]:
mask = pivot['mean']['house'] < pivot['median']['house']
filtered_pivot = pivot[mask]
display(filtered_pivot)

                      median                        mean              \
Type                   house townhouse  unit       house   townhouse
Regionname
Southern Metropolitan  586.0     246.0   0.0  569.643881  278.858824
Western Metropolitan   531.0     198.0  62.0  507.883406  244.560669


Type                         unit
Regionname
Southern Metropolitan  466.380245
Western Metropolitan   557.637232

In [ ]:
melb_df.pivot_table(
    values='BuildingArea',
    index='Type',
    columns='Rooms',
    aggfunc=['median']
).stack().idxmax()

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\1042098300.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  melb_df.pivot_table(
C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\1042098300.py:6: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  ).stack().idxmax()

median    (house, 7)
dtype: object

In [ ]:
melb_df.pivot_table(
    values='Price',
    index='SellerG',
    columns='Type',
    aggfunc='median'
)['unit'].idxmax()

C:\Users\pavba\AppData\Local\Temp\ipykernel_39100\1529246780.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  melb_df.pivot_table(

'Nick'

In [3]:
import pandas as pd
movies_df = pd.read_csv('data/movies_data/movies.csv', sep=',')

In [4]:
print(movies_df.shape[0])

9742

In [5]:
rat1_df = pd.read_csv('data/movies_data/ratings1.csv', sep=',')

In [6]:
print(rat1_df['userId'].nunique())

274

In [7]:
dates_df = pd.read_csv('data/movies_data/dates.csv', sep=',')

In [8]:
dates_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    100836 non-null  object
dtypes: object(1)
memory usage: 787.9+ KB

In [9]:
dates_df['date'] = pd.to_datetime(dates_df['date'], yearfirst=True)

In [10]:
dates_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    100836 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 787.9 KB

In [11]:
dates_df['year'] = dates_df['date'].dt.year

In [12]:
grouped_dates_df = dates_df.groupby('year').count()

In [13]:
print(grouped_dates_df)

       date
year
1996   6040
1997   1916
1998    507
1999   2439
2000  10061
2001   3922
2002   3478
2003   4014
2004   3279
2005   5813
2006   4059
2007   7114
2008   4351
2009   4158
2010   2301
2011   1690
2012   4656
2013   1664
2014   1439
2015   6616
2016   6703
2017   8198
2018   6418

In [14]:
print(dates_df['year'].value_counts().index[0])

2000

In [15]:
rat2_df = pd.read_csv('data/movies_data/ratings2.csv', sep=',')

In [16]:
ratings = pd.concat([rat1_df, rat2_df])

In [17]:
display(ratings)

       userId  movieId  rating
0           1        1     4.0
1           1        3     4.0
2           1        6     4.0
3           1       47     5.0
4           1       50     5.0
...       ...      ...     ...
60831     610   166534     4.0
60832     610   168248     5.0
60833     610   168250     5.0
60834     610   168252     5.0
60835     610   170875     3.0

[100837 rows x 3 columns]

In [18]:
ratings = pd.concat(
    [rat1_df, rat2_df],
    ignore_index=True
)
display(ratings)

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100832     610   166534     4.0
100833     610   168248     5.0
100834     610   168250     5.0
100835     610   168252     5.0
100836     610   170875     3.0

[100837 rows x 3 columns]

In [19]:
ratings = ratings.drop_duplicates(ignore_index=True)
print(f'The number of rows in ratings table is {ratings.shape[0]}')

The number of rows in ratings table is 100836

In [20]:
dates_df = dates_df.drop('year', axis=1)

In [21]:
ratings_dates = pd.concat([ratings, dates_df], axis=1)
display(ratings_dates.tail(7))

        userId  movieId  rating                date
100829     610   164179     5.0 2017-05-03 21:07:11
100830     610   166528     4.0 2017-05-04 06:29:25
100831     610   166534     4.0 2017-05-03 21:53:22
100832     610   168248     5.0 2017-05-03 22:21:31
100833     610   168250     5.0 2017-05-08 19:50:47
100834     610   168252     5.0 2017-05-03 21:19:12
100835     610   170875     3.0 2017-05-03 21:20:15

In [22]:
joined = ratings_dates.join(
    movies_df.set_index('movieId'),
    on='movieId',
    how='left'
)
display(joined.head())

,userId,movieId,rating,date,title,genres
0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [23]:
merged = ratings_dates.merge(
    movies_df,
    on='movieId',
    how='left'
)
display(merged.head())

,userId,movieId,rating,date,title,genres
0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [24]:
print(ratings_dates.shape[0] == merged.shape[0])

True

In [25]:
import re
def get_year_release(arg):
    candidates = re.findall(r'\(\d{4}\)', arg)
    if len(candidates) > 0:
        year = candidates[0].replace('(', '')
        year = year.replace(')', '')
        return int(year)
    else:
        return None

In [26]:
rating_movies = pd.read_csv('data/movies_data/ratings_movies.csv', sep=',', index_col=0)

In [27]:
display(rating_movies.head())

,userId,movieId,rating,date,title,genres
0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [28]:
rating_movies['year_release'] = rating_movies['title'].apply(get_year_release)

In [29]:
display(rating_movies['year_release'].isna().sum())

np.int64(18)

In [30]:
filtered_ratings = rating_movies[rating_movies['year_release'] == 1999]

In [31]:
print(filtered_ratings.sort_values('rating',ascending=True))

        userId  movieId  rating                 date  \
1134        10     2959     0.5  2016-02-13 09:43:02
100797     610   145951     0.5  2017-05-03 22:03:39
1132        10     2762     0.5  2016-02-13 09:39:48
1130        10     2571     0.5  2016-02-13 09:39:38
48007      311     2706     0.5  2003-07-10 16:23:50
...        ...      ...     ...                  ...
77534      483     2997     5.0  2010-07-01 14:59:19
77548      483     3174     5.0  2010-07-01 14:57:44
78070      484     2959     5.0  2012-07-14 01:15:54
78223      484    93320     5.0  2012-07-14 20:01:55
100040     610     8142     5.0  2016-11-19 08:48:44

                                     title                       genres  \
1134                     Fight Club (1999)  Action|Crime|Drama|Thriller
100797  Bloodsport: The Dark Kumite (1999)              Action|Thriller
1132               Sixth Sense, The (1999)         Drama|Horror|Mystery
1130                    Matrix, The (1999)       Action|Sci-Fi|Thriller
48007                  American Pie (1999)               Comedy|Romance
...                                    ...                          ...
77534          Being John Malkovich (1999)         Comedy|Drama|Fantasy
77548               Man on the Moon (1999)                 Comedy|Drama
78070                    Fight Club (1999)  Action|Crime|Drama|Thriller
78223             Trailer Park Boys (1999)                 Comedy|Crime
100040     Dead or Alive: Hanzaisha (1999)                 Action|Crime

        year_release
1134          1999.0
100797        1999.0
1132          1999.0
1130          1999.0
48007         1999.0
...              ...
77534         1999.0
77548         1999.0
78070         1999.0
78223         1999.0
100040        1999.0

[4536 rows x 7 columns]

In [32]:
rating_mean = filtered_ratings.groupby('title', as_index=False)['rating'].mean()
print(rating_mean.head())

                                               title    rating
0                  10 Things I Hate About You (1999)  3.527778
1                           13th Warrior, The (1999)  2.903846
2                              200 Cigarettes (1999)  3.166667
3  8 ½ Women (a.k.a. 8 1/2 Women) (a.k.a. Eight a...  3.333333
4                                         8MM (1999)  2.944444

In [33]:
print(rating_mean.sort_values('rating',ignore_index=True)['title'].iloc[0])

Bloodsport: The Dark Kumite (1999)

In [34]:
filtered_ratings = rating_movies[rating_movies['year_release'] == 2010]
rating_mean = filtered_ratings.groupby('genres', as_index=False)['rating'].mean()
print(rating_mean.head())

                                              genres  rating
0                                             Action    3.35
1           Action|Adventure|Children|Comedy|Fantasy    3.45
2  Action|Adventure|Comedy|Crime|Drama|Film-Noir|...    3.75
3             Action|Adventure|Comedy|Crime|Thriller    3.25
4                  Action|Adventure|Comedy|Drama|War    3.50

In [35]:
print(rating_mean.sort_values('rating', ignore_index=True)['genres'].iloc[0])

Action|Sci-Fi

In [36]:
grouped_userid = rating_movies.groupby('userId')['genres'].nunique()
print(grouped_userid)

userId
1      121
2       23
3       30
4       89
5       33
      ...
606    260
607    106
608    274
609     30
610    380
Name: genres, Length: 610, dtype: int64

In [37]:
print(grouped_userid.sort_values(ascending=False)[:1].index[0])

599

In [38]:
grouped_userid = rating_movies.groupby('userId')['rating'].agg(['count', 'mean'])
display(grouped_userid)

        count      mean
userId
1         232  4.366379
2          29  3.948276
3          39  2.435897
4         216  3.555556
5          44  3.636364
...       ...       ...
606      1115  3.657399
607       187  3.786096
608       831  3.134176
609        37  3.270270
610      1302  3.688556

[610 rows x 2 columns]

In [39]:
print(grouped_userid.sort_values(['count', 'mean'], ascending=[True, False]).index[0])

53

In [40]:
filtered_ratings = rating_movies[rating_movies['year_release'] == 2018]

In [41]:
grouped_genres = filtered_ratings.groupby('genres')['rating'].agg(['mean', 'count'])

In [42]:
mask = grouped_genres['count'] > 10

In [43]:
filtered_grouped_genres = grouped_genres[mask]

In [44]:
print(filtered_grouped_genres['mean'].idxmax())

Action|Adventure|Sci-Fi

In [45]:
rating_movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100836 entries, 0 to 100835
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   userId        100836 non-null  int64
 1   movieId       100836 non-null  int64
 2   rating        100836 non-null  float64
 3   date          100836 non-null  object
 4   title         100836 non-null  object
 5   genres        100836 non-null  object
 6   year_release  100818 non-null  float64
dtypes: float64(2), int64(2), object(3)
memory usage: 6.2+ MB

In [46]:
rating_movies['date'] = pd.to_datetime(rating_movies['date'])

In [47]:
rating_movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100836 entries, 0 to 100835
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   userId        100836 non-null  int64
 1   movieId       100836 non-null  int64
 2   rating        100836 non-null  float64
 3   date          100836 non-null  datetime64[ns]
 4   title         100836 non-null  object
 5   genres        100836 non-null  object
 6   year_release  100818 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 6.2+ MB

In [48]:
rating_movies['year_rating'] = rating_movies['date'].dt.year

In [49]:
print(rating_movies['year_rating'])

0         2000
1         2000
2         2000
3         2000
4         2000
          ...
100831    2017
100832    2017
100833    2017
100834    2017
100835    2017
Name: year_rating, Length: 100836, dtype: int32

In [50]:
pivot_table = rating_movies.pivot_table(
    values='rating',
    index='year_rating',
    columns='genres',
    aggfunc='mean',
)

In [55]:
print(pivot_table.loc[1996:2018]['Action|Adventure'].min())

3.2777777777777777

In [57]:
print(pivot_table['Action|Adventure|Animation|Children|Comedy|IMAX'].idxmax())

2013

In [66]:
print(pivot_table.loc[2018].sort_values(ascending=False).head(20))

genres
Comedy|Fantasy|Horror|Musical|Thriller    5.0
Animation|Comedy|Fantasy|Musical          5.0
Comedy|Crime|Fantasy                      5.0
Animation|Comedy|Drama|Fantasy|Sci-Fi     5.0
Mystery|Romance|Sci-Fi|Thriller           5.0
Action|Crime|Thriller|Western             5.0
Romance|Sci-Fi                            5.0
Crime|Mystery                             5.0
Animation|Comedy|Drama                    5.0
Animation|Children|Mystery                5.0
Action|Comedy|Documentary                 5.0
Drama|Horror|Mystery|Sci-Fi|Thriller      5.0
Action|Crime|Sci-Fi|Thriller              5.0
Comedy|Drama|Fantasy|Mystery|Romance      5.0
Crime|Fantasy|Horror                      5.0
Comedy|Crime|Horror|Thriller              5.0
Animation|Crime|Drama                     5.0
Drama|Romance|War                         5.0
Comedy|Horror|Mystery                     5.0
Adventure|Fantasy|Musical                 5.0
Name: 2018, dtype: float64

In [67]:
print(pivot_table.loc[1996:2018]['Comedy'])

year_rating
1996    3.228571
1997    3.409091
1998    3.000000
1999    3.606061
2000    3.141291
2001    3.318408
2002    3.198556
2003    3.120066
2004    3.356877
2005    2.963325
2006    3.347534
2007    2.928187
2008    3.426667
2009    3.273292
2010    3.179825
2011    3.232877
2012    3.478477
2013    3.489474
2014    3.271429
2015    3.106183
2016    3.373431
2017    2.852668
2018    3.121296
Name: Comedy, dtype: float64

In [68]:
import pandas as pd

orders = pd.read_csv('data/orders.csv', sep=';')
products = pd.read_csv('data/products.csv', sep=';')

In [69]:
orders_products = orders.merge(
    products,
    left_on='ID товара',
    right_on='Product_ID',
    how='left'
)

In [74]:
print(orders_products[['Order ID','Name']])

    Order ID                       Name
0          9      Носки Подарочные, муж
1          8         Носки Простые, муж
2          8      Носки Подарочные, жен
3          7      Носки Подарочные, жен
4          6      Носки Подарочные, жен
5          6      Носки Подарочные, муж
6          5       Носки беговые Camino
7          4         Носки Честные, муж
8          3      Носки Подарочные, муж
9          3      Носки Подарочные, жен
10         2   Платье Ночная Жизнь XXXL
11         2     Штаны Цветочная Поляна
12         2  Гольфы детские Снегурочка
13         2       Шатны Полосатый рейс
14         1        Платье Ночная Жизнь
15         1         Носки Простые, муж
16         1   Платье Аленький цветочек
17         0                        NaN

In [77]:
print(orders_products[orders_products['Отменен'] == 'Да']['Name'].iloc[0])

Носки беговые Camino

In [78]:
orders_products['profit'] = orders_products['Количество'] * orders_products['Price']

In [79]:
filtered_order_products = orders_products[orders_products['Оплачен'] == 'Да']

In [81]:
grouped_order_product = filtered_order_products.groupby(['ID Покупателя'])['profit'].agg('sum')

In [89]:
print(grouped_order_product.sort_values(ascending=False).index[0])

7